# CreateNumericSequence Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
RevisionNumberingSequence..::..CreateNumericSequence Method
RevisionNumberingSequence Class See Also
---
Creates a new numeric revision numbering sequence in the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public static RevisionNumberingSequence CreateNumericSequence(
	Document document,
	string name,
	NumericRevisionSettings settings
)
```

Visual Basic
---
```text
Public Shared Function CreateNumericSequence ( _
	document As Document, _
	name As String, _
	settings As NumericRevisionSettings _
) As RevisionNumberingSequence
```

Visual C++
---
```text
public:
static RevisionNumberingSequence^ CreateNumericSequence(
	Document^ document,
	String^ name,
	NumericRevisionSettings^ settings
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document of the new revision numbering sequence.
name
    Type: System..::..String The name for the revision numbering sequence.
settings
    Type: Autodesk.Revit.DB..::..NumericRevisionSettings The numeric settings for the revision numbering sequence.
# ### Return Value
The newly created revision numbering sequence.
# Remarks
The new revision numbering sequence will not be assigned to any revision. Use `Revision.SetRevisionNumberingSequenceId` to apply the sequence to a revision.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | document is not a project document. -or- name is an empty string or contains only whitespace. -or- name cannot include prohibited characters. -or- settings is not a valid NumericRevisionSettings. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). |
| Autodesk.Revit.Exceptions..::..ModificationForbiddenException | The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process. |
| Autodesk.Revit.Exceptions..::..ModificationOutsideTransactionException | The document has no open transaction. |

# See Also
RevisionNumberingSequence Class
Autodesk.Revit.DB Namespace